# SetLayoutAsSingle Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerItem..::..SetLayoutAsSingle Method
RebarContainerItem Class See Also
---
Sets the Layout Rule property of rebar set to Single.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetLayoutAsSingle()
```

Visual Basic
---
```text
Public Sub SetLayoutAsSingle
```

Visual C++
---
```text
public:
void SetLayoutAsSingle()
```

# Remarks
Only one bar will remain, which is at the position of rebar plane
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace